# Brewfile - explicitly installed Homebrew packages
# Generated: Sun Apr  5 10:51:21 IDT 2026
# Formulae filtered with 'brew leaves' (top-level only, no auto-dependencies)

tap "anomalyco/tap"
tap "hudochenkov/sshpass"
tap "rtk-ai/tap"

brew "cloudflared"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "ffmpeg"
brew "gh"
brew "hudochenkov/sshpass/sshpass"
brew "ollama"
brew "pnpm"
brew "pyenv"
brew "rtk-ai/tap/rtk"
brew "rustup"
brew "shellcheck"
brew "tmux"
brew "uv"
brew "watch"

cask "1password-cli"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"

